espressif/esp-idf/components/soc/esp32s31/register/soc/cache_struct.h
/** Type of l1_dcache_cachesize_conf register
 *  L1 data Cache CacheSize mode configure register
 */
typedef union {
    struct {
        /** l1_dcache_cachesize_256 : HRO; bitpos: [0]; default: 0;
         *  The field is used to configure cachesize of L1-DCache as 256 bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_cachesize_256:1;
        /** l1_dcache_cachesize_512 : HRO; bitpos: [1]; default: 0;
         *  The field is used to configure cachesize of L1-DCache as 512 bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_cachesize_512:1;
        /** l1_dcache_cachesize_1k : HRO; bitpos: [2]; default: 0;
         *  The field is used to configure cachesize of L1-DCache as 1k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_cachesize_1k:1;
        /** l1_dcache_cachesize_2k : HRO; bitpos: [3]; default: 0;
         *  The field is used to configure cachesize of L1-DCache as 2k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_cachesize_2k:1;
        /** l1_dcache_cachesize_4k : HRO; bitpos: [4]; default: 0;
         *  The field is used to configure cachesize of L1-DCache as 4k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_cachesize_4k:1;
        /** l1_dcache_cachesize_8k : HRO; bitpos: [5]; default: 0;
         *  The field is used to configure cachesize of L1-DCache as 8k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_cachesize_8k:1;
        /** l1_dcache_cachesize_16k : HRO; bitpos: [6]; default: 0;
         *  The field is used to configure cachesize of L1-DCache as 16k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_cachesize_16k:1;
        /** l1_dcache_cachesize_32k : HRO; bitpos: [7]; default: 0;
         *  The field is used to configure cachesize of L1-DCache as 32k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_cachesize_32k:1;
        /** l1_dcache_cachesize_64k : HRO; bitpos: [8]; default: 1;
         *  The field is used to configure cachesize of L1-DCache as 64k bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_dcache_cachesize_64k:1;
        /** l1_dcache_cachesize_128k : HRO; bitpos: [9]; default: 0;
         *  The field is used to configure cachesize of L1-DCache as 128k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_cachesize_128k:1;
        /** l1_dcache_cachesize_256k : HRO; bitpos: [10]; default: 0;
         *  The field is used to configure cachesize of L1-DCache as 256k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_cachesize_256k:1;
        /** l1_dcache_cachesize_512k : HRO; bitpos: [11]; default: 0;
         *  The field is used to configure cachesize of L1-DCache as 512k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_cachesize_512k:1;
        /** l1_dcache_cachesize_1024k : HRO; bitpos: [12]; default: 0;
         *  The field is used to configure cachesize of L1-DCache as 1024k bytes. This field
         *  and all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_cachesize_1024k:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} cache_l1_dcache_cachesize_conf_reg_t;

/** Type of l1_dcache_blocksize_conf register
 *  L1 data Cache BlockSize mode configure register
 */
typedef union {
    struct {
        /** l1_dcache_blocksize_8 : HRO; bitpos: [0]; default: 0;
         *  The field is used to configureblocksize of L1-DCache as 8 bytes. This field and all
         *  other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_blocksize_8:1;
        /** l1_dcache_blocksize_16 : HRO; bitpos: [1]; default: 0;
         *  The field is used to configureblocksize of L1-DCache as 16 bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_blocksize_16:1;
        /** l1_dcache_blocksize_32 : HRO; bitpos: [2]; default: 0;
         *  The field is used to configureblocksize of L1-DCache as 32 bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_blocksize_32:1;
        /** l1_dcache_blocksize_64 : HRO; bitpos: [3]; default: 1;
         *  The field is used to configureblocksize of L1-DCache as 64 bytes. This field and
         *  all other fields within this register is onehot.
         */
        uint32_t l1_dcache_blocksize_64:1;
        /** l1_dcache_blocksize_128 : HRO; bitpos: [4]; default: 0;
         *  The field is used to configureblocksize of L1-DCache as 128 bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_blocksize_128:1;
        /** l1_dcache_blocksize_256 : HRO; bitpos: [5]; default: 0;
         *  The field is used to configureblocksize of L1-DCache as 256 bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_dcache_blocksize_256:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l1_dcache_blocksize_conf_reg_t;

