espressif/esp-idf/components/soc/esp32s31/register/soc/cache_struct.h
/** Type of l2_cache_cachesize_conf register
 *  L2 Cache CacheSize mode configure register
 */
typedef union {
    struct {
        /** l2_cache_cachesize_256 : HRO; bitpos: [0]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 256 bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_cachesize_256:1;
        /** l2_cache_cachesize_512 : HRO; bitpos: [1]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 512 bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_cachesize_512:1;
        /** l2_cache_cachesize_1k : HRO; bitpos: [2]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 1k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_cachesize_1k:1;
        /** l2_cache_cachesize_2k : HRO; bitpos: [3]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 2k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_cachesize_2k:1;
        /** l2_cache_cachesize_4k : HRO; bitpos: [4]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 4k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_cachesize_4k:1;
        /** l2_cache_cachesize_8k : HRO; bitpos: [5]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 8k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_cachesize_8k:1;
        /** l2_cache_cachesize_16k : HRO; bitpos: [6]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 16k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_cachesize_16k:1;
        /** l2_cache_cachesize_32k : HRO; bitpos: [7]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 32k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_cachesize_32k:1;
        /** l2_cache_cachesize_64k : HRO; bitpos: [8]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 64k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_cachesize_64k:1;
        /** l2_cache_cachesize_128k : HRO; bitpos: [9]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 128k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_cachesize_128k:1;
        /** l2_cache_cachesize_256k : HRO; bitpos: [10]; default: 1;
         *  The field is used to configure cachesize of L2-Cache as 256k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_cachesize_256k:1;
        /** l2_cache_cachesize_512k : HRO; bitpos: [11]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 512k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_cachesize_512k:1;
        /** l2_cache_cachesize_1024k : HRO; bitpos: [12]; default: 0;
         *  The field is used to configure cachesize of L2-Cache as 1024k bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_cachesize_1024k:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} cache_l2_cache_cachesize_conf_reg_t;

/** Type of l2_cache_blocksize_conf register
 *  L2 Cache BlockSize mode configure register
 */
typedef union {
    struct {
        /** l2_cache_blocksize_8 : HRO; bitpos: [0]; default: 0;
         *  The field is used to configureblocksize of L2-Cache as 8 bytes. This field and all
         *  other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_blocksize_8:1;
        /** l2_cache_blocksize_16 : HRO; bitpos: [1]; default: 0;
         *  The field is used to configureblocksize of L2-Cache as 16 bytes. This field and all
         *  other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_blocksize_16:1;
        /** l2_cache_blocksize_32 : HRO; bitpos: [2]; default: 0;
         *  The field is used to configureblocksize of L2-Cache as 32 bytes. This field and all
         *  other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_blocksize_32:1;
        /** l2_cache_blocksize_64 : HRO; bitpos: [3]; default: 1;
         *  The field is used to configureblocksize of L2-Cache as 64 bytes. This field and all
         *  other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_blocksize_64:1;
        /** l2_cache_blocksize_128 : HRO; bitpos: [4]; default: 0;
         *  The field is used to configureblocksize of L2-Cache as 128 bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_blocksize_128:1;
        /** l2_cache_blocksize_256 : HRO; bitpos: [5]; default: 0;
         *  The field is used to configureblocksize of L2-Cache as 256 bytes. This field and
         *  all other fields within this register is onehot.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_blocksize_256:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l2_cache_blocksize_conf_reg_t;


/** Group: Wrap Mode Control and configuration registers */
/** Type of l1_cache_wrap_around_ctrl register
 *  Cache wrap around control register
 */
typedef union {
    struct {
        /** l1_icache0_wrap : R/W; bitpos: [0]; default: 0;
         *  Configures whether to enable the critical word first function.
         *  1: Enable
         */
        uint32_t l1_icache0_wrap:1;
        /** l1_icache1_wrap : R/W; bitpos: [1]; default: 0;
         *  Configures whether to enable the critical word first function.
         *  1: Enable
         */
        uint32_t l1_icache1_wrap:1;
        /** l1_icache2_wrap : HRO; bitpos: [2]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_wrap:1;
        /** l1_icache3_wrap : HRO; bitpos: [3]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_wrap:1;
        /** l1_dcache_wrap : R/W; bitpos: [4]; default: 0;
         *  Configures whether to enable the critical word first function.
         *  1: Enable
         */
        uint32_t l1_dcache_wrap:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_wrap_around_ctrl_reg_t;

/** Type of l2_cache_wrap_around_ctrl register
 *  Cache wrap around control register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_wrap : HRO; bitpos: [5]; default: 0;
         *  Set this bit as 1 to enable L2-Cache wrap around mode.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_wrap:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l2_cache_wrap_around_ctrl_reg_t;


/** Group: Early Restart Control registers */
/** Type of l1_cache_miss_access_ctrl register
 *  Cache wrap around control register
 */
typedef union {
    struct {
        /** l1_icache0_miss_disable_access : R/W; bitpos: [0]; default: 0;
         *  Configures whether to enable early restart function.
         *  1: Enable
         */
        uint32_t l1_icache0_miss_disable_access:1;
        /** l1_icache1_miss_disable_access : R/W; bitpos: [1]; default: 0;
         *  Configures whether to enable early restart function.
         *  1: Enable
         */
        uint32_t l1_icache1_miss_disable_access:1;
        /** l1_icache2_miss_disable_access : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache2_miss_disable_access:1;
        /** l1_icache3_miss_disable_access : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_icache3_miss_disable_access:1;
        /** l1_cache_miss_disable_access : R/W; bitpos: [4]; default: 0;
         *  Configures whether to enable early restart function.
         *  1: Enable
         */
        uint32_t l1_cache_miss_disable_access:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_miss_access_ctrl_reg_t;

