espressif/esp-idf/components/soc/esp32s31/register/soc/cache_struct.h
/** Type of lock_addr register
 *  Lock (manual lock) address configure register
 */
typedef union {
    struct {
        /** lock_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the start address of the lock/unlock operation, which should be used
         *  together with CACHE_LOCK_SIZE_REG
         */
        uint32_t lock_addr:32;
    };
    uint32_t val;
} cache_lock_addr_reg_t;

/** Type of lock_size register
 *  Lock (manual lock) size configure register
 */
typedef union {
    struct {
        /** lock_size : R/W; bitpos: [15:0]; default: 0;
         *  Configures the size of the lock/unlock operation, which should be used together
         *  with CACHE_LOCK_ADDR_REG
         */
        uint32_t lock_size:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} cache_lock_size_reg_t;


/** Group: Sync Control and configuration registers */
/** Type of sync_ctrl register
 *  Sync-class operation control register
 */
typedef union {
    struct {
        /** invalidate_ena : R/W/SC; bitpos: [0]; default: 1;
         *  Configures whether to enable the invalidation operation. Hardware will clear it
         *  once the operation has finished.
         *  Please note that this field, along with the other fields (CLEAN_ENA, WRITEBACK_ENA,
         *  WRITEBACK_INVALIDATE_ENA), is mutually exclusive. In other words, only one of these
         *  fields can be set to 1 at any given time.
         */
        uint32_t invalidate_ena:1;
        /** clean_ena : R/W/SC; bitpos: [1]; default: 0;
         *  Configures whether to enable the clean operation. Hardware will clear it once the
         *  operation has finished.
         *  1: Enable
         */
        uint32_t clean_ena:1;
        /** writeback_ena : R/W/SC; bitpos: [2]; default: 0;
         *  Configures whether to enable the write-back operation. Hardware will clear it once
         *  the operation has finished.
         *  1: Enable
         */
        uint32_t writeback_ena:1;
        /** writeback_invalidate_ena : R/W/SC; bitpos: [3]; default: 0;
         *  Configures whether to enable the write-back invalidation operation. Hardware will
         *  clear it once the operation has finished.
         *  1: Enable
         */
        uint32_t writeback_invalidate_ena:1;
        /** sync_done : RO; bitpos: [4]; default: 0;
         *  Indicates whether the synchronization operation has finished.
         *  1: Finished
         */
        uint32_t sync_done:1;
        /** sync_rgid : R/W; bitpos: [8:5]; default: 0;
         *  Configures the gid of cache sync operation (invalidate, clean, writeback,
         *  writeback_invalidate)
         */
        uint32_t sync_rgid:4;
        uint32_t reserved_9:23;
    };
    uint32_t val;
} cache_sync_ctrl_reg_t;

/** Type of sync_map register
 *  Sync map configure register
 */
typedef union {
    struct {
        /** sync_map : R/W; bitpos: [5:0]; default: 31;
         *  Configures which cache to perform the locking or the unlocking operation.
         *  Other bits: Reserved
         */
        uint32_t sync_map:6;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_sync_map_reg_t;

/** Type of sync_addr register
 *  Sync address configure register
 */
typedef union {
    struct {
        /** sync_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the start address of the sync operation, which should be used together
         *  with CACHE_SYNC_SIZE_REG
         */
        uint32_t sync_addr:32;
    };
    uint32_t val;
} cache_sync_addr_reg_t;

/** Type of sync_size register
 *  Sync size configure register
 */
typedef union {
    struct {
        /** sync_size : R/W; bitpos: [27:0]; default: 0;
         *  Configures the size of the sync operation, which should be used together with
         *  CACHE_SYNC_ADDR_REG
         */
        uint32_t sync_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_sync_size_reg_t;


/** Group: Preload Control and configuration registers */
/** Type of l1_icache0_preload_ctrl register
 *  L1 instruction Cache 0 preload-operation control register
 */
typedef union {
    struct {
        /** l1_icache0_preload_ena : R/W/SC; bitpos: [0]; default: 0;
         *  Configures whether to enable the preloading operation in icache0. Hardware will
         *  clear it once the operation has finished.
         *  1: Enable
         */
        uint32_t l1_icache0_preload_ena:1;
        /** l1_icache0_preload_done : RO; bitpos: [1]; default: 1;
         *  Represents whether the preloading operation has finished.
         *  1: Finished
         */
        uint32_t l1_icache0_preload_done:1;
        /** l1_icache0_preload_order : R/W; bitpos: [2]; default: 0;
         *  Configures the direction of the preloading operation.
         *  1: Descending
         */
        uint32_t l1_icache0_preload_order:1;
        /** l1_icache0_preload_rgid : R/W; bitpos: [6:3]; default: 0;
         *  Configures the gid of l1 icache0 preload.
         */
        uint32_t l1_icache0_preload_rgid:4;
        /** l1_icache0_preload_mode : R/W; bitpos: [7]; default: 0;
         *  Configures the mode of l1 icache0 preload, 0: load data from next level memory, 1:
         *  not load data from next level memory.
         */
        uint32_t l1_icache0_preload_mode:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} cache_l1_icache0_preload_ctrl_reg_t;

/** Type of l1_icache0_preload_addr register
 *  icache0 preload address configuration register
 */
typedef union {
    struct {
        /** l1_icache0_preload_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the start address of preload on L1-ICache0, which should be used
         *  together with L1_ICACHE0_PRELOAD_SIZE_REG
         */
        uint32_t l1_icache0_preload_addr:32;
    };
    uint32_t val;
} cache_l1_icache0_preload_addr_reg_t;

/** Type of l1_icache0_preload_size register
 *  L1 instruction Cache 0 preload size configure register
 */
typedef union {
    struct {
        /** l1_icache0_preload_size : R/W; bitpos: [13:0]; default: 0;
         *  Configures the size of the first section of prelock on L1-ICache0, which should be
         *  used together with L1_ICACHE0_PRELOAD_ADDR_REG
         */
        uint32_t l1_icache0_preload_size:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_icache0_preload_size_reg_t;

/** Type of l1_icache1_preload_ctrl register
 *  L1 instruction Cache 1 preload-operation control register
 */
typedef union {
    struct {
        /** l1_icache1_preload_ena : R/W/SC; bitpos: [0]; default: 0;
         *  Configures whether to enable the preloading operation in icache1. Hardware will
         *  clear it once the operation has finished.
         *  1: Enable
         */
        uint32_t l1_icache1_preload_ena:1;
        /** l1_icache1_preload_done : RO; bitpos: [1]; default: 1;
         *  Represents whether the preloading operation has finished.
         *  1: Finished
         */
        uint32_t l1_icache1_preload_done:1;
        /** l1_icache1_preload_order : R/W; bitpos: [2]; default: 0;
         *  Configures the direction of the preloading operation.
         *  1: Descending
         */
        uint32_t l1_icache1_preload_order:1;
        /** l1_icache1_preload_rgid : R/W; bitpos: [6:3]; default: 0;
         *  Configures the gid of l1 icache1 preload.
         */
        uint32_t l1_icache1_preload_rgid:4;
        /** l1_icache1_preload_mode : R/W; bitpos: [7]; default: 0;
         *  Configures the mode of l1 icache1 preload, 0: load data from next level memory, 1:
         *  not load data from next level memory.
         */
        uint32_t l1_icache1_preload_mode:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} cache_l1_icache1_preload_ctrl_reg_t;

/** Type of l1_icache1_preload_addr register
 *  icache1 preload address configuration register
 */
typedef union {
    struct {
        /** l1_icache1_preload_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the start address of preload on L1-ICache1, which should be used
         *  together with L1_ICACHE1_PRELOAD_SIZE_REG
         */
        uint32_t l1_icache1_preload_addr:32;
    };
    uint32_t val;
} cache_l1_icache1_preload_addr_reg_t;

/** Type of l1_icache1_preload_size register
 *  L1 instruction Cache 1 preload size configure register
 */
typedef union {
    struct {
        /** l1_icache1_preload_size : R/W; bitpos: [13:0]; default: 0;
         *  Configures the size of the first section of prelock on L1-ICache1, which should be
         *  used together with L1_ICACHE1_PRELOAD_ADDR_REG
         */
        uint32_t l1_icache1_preload_size:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_icache1_preload_size_reg_t;

/** Type of l1_icache2_preload_ctrl register
 *  L1 instruction Cache 2 preload-operation control register
 */
typedef union {
    struct {
        /** l1_icache2_preload_ena : R/W/SC; bitpos: [0]; default: 0;
         *  Configures preload operation on L1-ICache2. It will be cleared by hardware
         *  automatically after preload operation is done.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_preload_ena:1;
        /** l1_icache2_preload_done : RO; bitpos: [1]; default: 1;
         *  The bit is used to indicate whether preload operation is finished or not. 0: not
         *  finished. 1: finished.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_preload_done:1;
        /** l1_icache2_preload_order : HRO; bitpos: [2]; default: 0;
         *  Configures the direction of preload operation. 0: ascending, 1: descending.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_preload_order:1;
        /** l1_icache2_preload_rgid : HRO; bitpos: [6:3]; default: 0;
         *  Configures the gid of l1 icache2 preload.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_preload_rgid:4;
        /** l1_icache2_preload_mode : HRO; bitpos: [7]; default: 0;
         *  Configures the mode of l1 icache2 preload, 0: load data from next level memory, 1:
         *  not load data from next level memory.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_preload_mode:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} cache_l1_icache2_preload_ctrl_reg_t;

/** Type of l1_icache2_preload_addr register
 *  L1 instruction Cache 2 preload address configure register
 */
typedef union {
    struct {
        /** l1_icache2_preload_addr : HRO; bitpos: [31:0]; default: 0;
         *  Configures the start address of preload on L1-ICache2, which should be used
         *  together with L1_ICACHE2_PRELOAD_SIZE_REG
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_preload_addr:32;
    };
    uint32_t val;
} cache_l1_icache2_preload_addr_reg_t;

