espressif/esp-idf/components/soc/esp32s31/register/soc/cache_struct.h
/** Type of l1_icache2_preload_size register
 *  L1 instruction Cache 2 preload size configure register
 */
typedef union {
    struct {
        /** l1_icache2_preload_size : HRO; bitpos: [13:0]; default: 0;
         *  Configures the size of the first section of prelock on L1-ICache2, which should be
         *  used together with L1_ICACHE2_PRELOAD_ADDR_REG
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_preload_size:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_icache2_preload_size_reg_t;

/** Type of l1_icache3_preload_ctrl register
 *  L1 instruction Cache 3 preload-operation control register
 */
typedef union {
    struct {
        /** l1_icache3_preload_ena : R/W/SC; bitpos: [0]; default: 0;
         *  Configures preload operation on L1-ICache3. It will be cleared by hardware
         *  automatically after preload operation is done.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_preload_ena:1;
        /** l1_icache3_preload_done : RO; bitpos: [1]; default: 1;
         *  The bit is used to indicate whether preload operation is finished or not. 0: not
         *  finished. 1: finished.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_preload_done:1;
        /** l1_icache3_preload_order : HRO; bitpos: [2]; default: 0;
         *  Configures the direction of preload operation. 0: ascending, 1: descending.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_preload_order:1;
        /** l1_icache3_preload_rgid : HRO; bitpos: [6:3]; default: 0;
         *  Configures the gid of l1 icache3 preload.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_preload_rgid:4;
        /** l1_icache3_preload_mode : HRO; bitpos: [7]; default: 0;
         *  Configures the mode of l1 icache3 preload, 0: load data from next level memory, 1:
         *  not load data from next level memory.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_preload_mode:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} cache_l1_icache3_preload_ctrl_reg_t;

/** Type of l1_icache3_preload_addr register
 *  L1 instruction Cache 3 preload address configure register
 */
typedef union {
    struct {
        /** l1_icache3_preload_addr : HRO; bitpos: [31:0]; default: 0;
         *  Configures the start address of preload on L1-ICache3, which should be used
         *  together with L1_ICACHE3_PRELOAD_SIZE_REG
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_preload_addr:32;
    };
    uint32_t val;
} cache_l1_icache3_preload_addr_reg_t;

/** Type of l1_icache3_preload_size register
 *  L1 instruction Cache 3 preload size configure register
 */
typedef union {
    struct {
        /** l1_icache3_preload_size : HRO; bitpos: [13:0]; default: 0;
         *  Configures the size of the first section of prelock on L1-ICache3, which should be
         *  used together with L1_ICACHE3_PRELOAD_ADDR_REG
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_preload_size:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_icache3_preload_size_reg_t;

/** Type of l1_dcache_preload_ctrl register
 *  L1 data Cache  preload-operation control register
 */
typedef union {
    struct {
        /** l1_dcache_preload_ena : R/W/SC; bitpos: [0]; default: 0;
         *  Configures whether to enable the preloading operation in dcache. Hardware will
         *  clear it once the operation has finished.
         *  1: Enable
         */
        uint32_t l1_dcache_preload_ena:1;
        /** l1_dcache_preload_done : RO; bitpos: [1]; default: 1;
         *  Represents whether the preloading operation has finished.
         *  1: Finished
         */
        uint32_t l1_dcache_preload_done:1;
        /** l1_dcache_preload_order : R/W; bitpos: [2]; default: 0;
         *  Configures the direction of the preloading operation.
         *  1: Descending
         */
        uint32_t l1_dcache_preload_order:1;
        /** l1_dcache_preload_rgid : R/W; bitpos: [6:3]; default: 0;
         *  Configures the gid of l1 dcache preload.
         */
        uint32_t l1_dcache_preload_rgid:4;
        /** l1_dcache_preload_mode : R/W; bitpos: [7]; default: 0;
         *  Configures the mode of l1 dcache preload, 0: load data from next level memory, 1:
         *  not load data from next level memory.
         */
        uint32_t l1_dcache_preload_mode:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} cache_l1_dcache_preload_ctrl_reg_t;

/** Type of l1_dcache_preload_addr register
 *  dcache preload address configuration register
 */
typedef union {
    struct {
        /** l1_dcache_preload_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the start address of preload on L1-DCache, which should be used together
         *  with L1_DCACHE_PRELOAD_SIZE_REG
         */
        uint32_t l1_dcache_preload_addr:32;
    };
    uint32_t val;
} cache_l1_dcache_preload_addr_reg_t;

/** Type of l1_dcache_preload_size register
 *  L1 data Cache  preload size configure register
 */
typedef union {
    struct {
        /** l1_dcache_preload_size : R/W; bitpos: [13:0]; default: 0;
         *  Configures the size of the first section of prelock on L1-DCache, which should be
         *  used together with L1_DCACHE_PRELOAD_ADDR_REG
         */
        uint32_t l1_dcache_preload_size:14;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_dcache_preload_size_reg_t;

/** Type of l2_cache_preload_ctrl register
 *  L2 Cache preload-operation control register
 */
typedef union {
    struct {
        /** l2_cache_preload_ena : R/W/SC; bitpos: [0]; default: 0;
         *  Configures preload operation on L2-Cache. It will be cleared by hardware
         *  automatically after preload operation is done.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_preload_ena:1;
        /** l2_cache_preload_done : RO; bitpos: [1]; default: 1;
         *  The bit is used to indicate whether preload operation is finished or not. 0: not
         *  finished. 1: finished.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_preload_done:1;
        /** l2_cache_preload_order : HRO; bitpos: [2]; default: 0;
         *  Configures the direction of preload operation. 0: ascending, 1: descending.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_preload_order:1;
        /** l2_cache_preload_rgid : HRO; bitpos: [6:3]; default: 0;
         *  Configures the gid of l2 cache preload.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_preload_rgid:4;
        /** l2_cache_preload_mode : HRO; bitpos: [7]; default: 0;
         *  Configures the mode of l2 cache preload, 0: load data from next level memory, 1:
         *  not load data from next level memory.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_preload_mode:1;
        uint32_t reserved_8:24;
    };
    uint32_t val;
} cache_l2_cache_preload_ctrl_reg_t;

/** Type of l2_cache_preload_addr register
 *  L2 Cache preload address configure register
 */
typedef union {
    struct {
        /** l2_cache_preload_addr : HRO; bitpos: [31:0]; default: 0;
         *  Configures the start address of preload on L2-Cache, which should be used together
         *  with L2_CACHE_PRELOAD_SIZE_REG
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_preload_addr:32;
    };
    uint32_t val;
} cache_l2_cache_preload_addr_reg_t;

