espressif/esp-idf/components/soc/esp32s31/register/soc/cache_struct.h
/** Type of l2_cache_preload_size register
 *  L2 Cache preload size configure register
 */
typedef union {
    struct {
        /** l2_cache_preload_size : HRO; bitpos: [15:0]; default: 0;
         *  Configures the size of the first section of prelock on L2-Cache, which should be
         *  used together with L2_CACHE_PRELOAD_ADDR_REG
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_preload_size:16;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} cache_l2_cache_preload_size_reg_t;


/** Group: Autoload Control and configuration registers */
/** Type of l1_icache0_autoload_ctrl register
 *  L1 instruction Cache 0 autoload-operation control register
 */
typedef union {
    struct {
        /** l1_icache0_autoload_ena : R/W; bitpos: [0]; default: 0;
         *  Configures whether to enable the autoloading operation in icache0.
         *  1: Enable
         */
        uint32_t l1_icache0_autoload_ena:1;
        /** l1_icache0_autoload_done : RO; bitpos: [1]; default: 1;
         *  Indicates whether the autoloading operation in icache0 has finished.
         *  1: Finished
         */
        uint32_t l1_icache0_autoload_done:1;
        /** l1_icache0_autoload_order : R/W; bitpos: [2]; default: 0;
         *  Configures the direction of the autoloading operation in icache0.
         *  1: Descending
         */
        uint32_t l1_icache0_autoload_order:1;
        /** l1_icache0_autoload_trigger_mode : R/W; bitpos: [4:3]; default: 0;
         *  Configures the trigger mode of the autoloading operation in icache0.
         *  2: Triggered by cache miss or hit
         */
        uint32_t l1_icache0_autoload_trigger_mode:2;
        uint32_t reserved_5:3;
        /** l1_icache0_autoload_sct0_ena : R/W; bitpos: [8]; default: 0;
         *  Configures whether to enable Section 0 for the autoloading operation in icache0.
         *  1: Enable
         */
        uint32_t l1_icache0_autoload_sct0_ena:1;
        /** l1_icache0_autoload_sct1_ena : R/W; bitpos: [9]; default: 0;
         *  Configures whether to enable Section 1 for the autoloading operation in icache0.
         *  1: Enable
         */
        uint32_t l1_icache0_autoload_sct1_ena:1;
        /** l1_icache0_autoload_rgid : R/W; bitpos: [13:10]; default: 0;
         *  Configures the gid of l1 icache0 autoload.
         */
        uint32_t l1_icache0_autoload_rgid:4;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_icache0_autoload_ctrl_reg_t;

/** Type of l1_icache0_autoload_sct0_addr register
 *  L1 instruction Cache 0 autoload section 0 address configure register
 */
typedef union {
    struct {
        /** l1_icache0_autoload_sct0_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the start address of the first section for autoload operation on
         *  L1-ICache0. Note that it should be used together with L1_ICACHE0_AUTOLOAD_SCT0_SIZE
         *  and L1_ICACHE_AUTOLOAD_SCT0_ENA.
         */
        uint32_t l1_icache0_autoload_sct0_addr:32;
    };
    uint32_t val;
} cache_l1_icache0_autoload_sct0_addr_reg_t;

/** Type of l1_icache0_autoload_sct0_size register
 *  L1 instruction Cache 0 autoload section 0 size configure register
 */
typedef union {
    struct {
        /** l1_icache0_autoload_sct0_size : R/W; bitpos: [27:0]; default: 0;
         *  Configures the size of the first section for autoload operation on L1-ICache0. Note
         *  that it should be used together with L1_ICACHE0_AUTOLOAD_SCT0_ADDR and
         *  L1_ICACHE_AUTOLOAD_SCT0_ENA.
         */
        uint32_t l1_icache0_autoload_sct0_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l1_icache0_autoload_sct0_size_reg_t;

/** Type of l1_icache0_autoload_sct1_addr register
 *  L1 instruction Cache 0 autoload section 1 address configure register
 */
typedef union {
    struct {
        /** l1_icache0_autoload_sct1_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the start address of the second section for autoload operation on
         *  L1-ICache0. Note that it should be used together with L1_ICACHE0_AUTOLOAD_SCT1_SIZE
         *  and L1_ICACHE_AUTOLOAD_SCT1_ENA.
         */
        uint32_t l1_icache0_autoload_sct1_addr:32;
    };
    uint32_t val;
} cache_l1_icache0_autoload_sct1_addr_reg_t;

/** Type of l1_icache0_autoload_sct1_size register
 *  L1 instruction Cache 0 autoload section 1 size configure register
 */
typedef union {
    struct {
        /** l1_icache0_autoload_sct1_size : R/W; bitpos: [27:0]; default: 0;
         *  Configures the size of the second section for autoload operation on L1-ICache0.
         *  Note that it should be used together with L1_ICACHE0_AUTOLOAD_SCT1_ADDR and
         *  L1_ICACHE_AUTOLOAD_SCT1_ENA.
         */
        uint32_t l1_icache0_autoload_sct1_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l1_icache0_autoload_sct1_size_reg_t;

/** Type of l1_icache1_autoload_ctrl register
 *  L1 instruction Cache 1 autoload-operation control register
 */
typedef union {
    struct {
        /** l1_icache1_autoload_ena : R/W; bitpos: [0]; default: 0;
         *  Configures whether to enable the autoloading operation in icache1.
         *  1: Enable
         */
        uint32_t l1_icache1_autoload_ena:1;
        /** l1_icache1_autoload_done : RO; bitpos: [1]; default: 1;
         *  Indicates whether the autoloading operation in icache1 has finished.
         *  1: Finished
         */
        uint32_t l1_icache1_autoload_done:1;
        /** l1_icache1_autoload_order : R/W; bitpos: [2]; default: 0;
         *  Configures the direction of the autoloading operation in icache1.
         *  1: Descending
         */
        uint32_t l1_icache1_autoload_order:1;
        /** l1_icache1_autoload_trigger_mode : R/W; bitpos: [4:3]; default: 0;
         *  Configures the trigger mode of the autoloading operation in icache1.
         *  2: Triggered by cache miss or hit
         */
        uint32_t l1_icache1_autoload_trigger_mode:2;
        uint32_t reserved_5:3;
        /** l1_icache1_autoload_sct0_ena : R/W; bitpos: [8]; default: 0;
         *  Configures whether to enable Section 0 for the autoloading operation in icache1.
         *  1: Enable
         */
        uint32_t l1_icache1_autoload_sct0_ena:1;
        /** l1_icache1_autoload_sct1_ena : R/W; bitpos: [9]; default: 0;
         *  Configures whether to enable Section 1 for the autoloading operation in icache1.
         *  1: Enable
         */
        uint32_t l1_icache1_autoload_sct1_ena:1;
        /** l1_icache1_autoload_rgid : R/W; bitpos: [13:10]; default: 0;
         *  Configures the gid of l1 icache1 autoload.
         */
        uint32_t l1_icache1_autoload_rgid:4;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_icache1_autoload_ctrl_reg_t;

/** Type of l1_icache1_autoload_sct0_addr register
 *  L1 instruction Cache 1 autoload section 0 address configure register
 */
typedef union {
    struct {
        /** l1_icache1_autoload_sct0_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the start address of the first section for autoload operation on
         *  L1-ICache1. Note that it should be used together with L1_ICACHE1_AUTOLOAD_SCT0_SIZE
         *  and L1_ICACHE_AUTOLOAD_SCT0_ENA.
         */
        uint32_t l1_icache1_autoload_sct0_addr:32;
    };
    uint32_t val;
} cache_l1_icache1_autoload_sct0_addr_reg_t;

/** Type of l1_icache1_autoload_sct0_size register
 *  L1 instruction Cache 1 autoload section 0 size configure register
 */
typedef union {
    struct {
        /** l1_icache1_autoload_sct0_size : R/W; bitpos: [27:0]; default: 0;
         *  Configures the size of the first section for autoload operation on L1-ICache1. Note
         *  that it should be used together with L1_ICACHE1_AUTOLOAD_SCT0_ADDR and
         *  L1_ICACHE_AUTOLOAD_SCT0_ENA.
         */
        uint32_t l1_icache1_autoload_sct0_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l1_icache1_autoload_sct0_size_reg_t;

/** Type of l1_icache1_autoload_sct1_addr register
 *  L1 instruction Cache 1 autoload section 1 address configure register
 */
typedef union {
    struct {
        /** l1_icache1_autoload_sct1_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the start address of the second section for autoload operation on
         *  L1-ICache1. Note that it should be used together with L1_ICACHE1_AUTOLOAD_SCT1_SIZE
         *  and L1_ICACHE_AUTOLOAD_SCT1_ENA.
         */
        uint32_t l1_icache1_autoload_sct1_addr:32;
    };
    uint32_t val;
} cache_l1_icache1_autoload_sct1_addr_reg_t;

/** Type of l1_icache1_autoload_sct1_size register
 *  L1 instruction Cache 1 autoload section 1 size configure register
 */
typedef union {
    struct {
        /** l1_icache1_autoload_sct1_size : R/W; bitpos: [27:0]; default: 0;
         *  Configures the size of the second section for autoload operation on L1-ICache1.
         *  Note that it should be used together with L1_ICACHE1_AUTOLOAD_SCT1_ADDR and
         *  L1_ICACHE_AUTOLOAD_SCT1_ENA.
         */
        uint32_t l1_icache1_autoload_sct1_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l1_icache1_autoload_sct1_size_reg_t;

/** Type of l1_icache2_autoload_ctrl register
 *  L1 instruction Cache 2 autoload-operation control register
 */
typedef union {
    struct {
        /** l1_icache2_autoload_ena : HRO; bitpos: [0]; default: 0;
         *  Configures and disable autoload operation on L1-ICache2.  1: enable, 0: disable.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_autoload_ena:1;
        /** l1_icache2_autoload_done : RO; bitpos: [1]; default: 1;
         *  The bit is used to indicate whether autoload operation on L1-ICache2 is finished or
         *  not. 0: not finished. 1: finished.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_autoload_done:1;
        /** l1_icache2_autoload_order : HRO; bitpos: [2]; default: 0;
         *  Configures the direction of autoload operation on L1-ICache2. 0: ascending. 1:
         *  descending.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_autoload_order:1;
        /** l1_icache2_autoload_trigger_mode : HRO; bitpos: [4:3]; default: 0;
         *  The field is used to configure trigger mode of autoload operation on L1-ICache2.
         *  0/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_autoload_trigger_mode:2;
        uint32_t reserved_5:3;
        /** l1_icache2_autoload_sct0_ena : HRO; bitpos: [8]; default: 0;
         *  Configures the first section for autoload operation on L1-ICache2.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_autoload_sct0_ena:1;
        /** l1_icache2_autoload_sct1_ena : HRO; bitpos: [9]; default: 0;
         *  Configures the second section for autoload operation on L1-ICache2.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_autoload_sct1_ena:1;
        /** l1_icache2_autoload_rgid : HRO; bitpos: [13:10]; default: 0;
         *  Configures the gid of l1 icache2 autoload.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_autoload_rgid:4;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_icache2_autoload_ctrl_reg_t;

/** Type of l1_icache2_autoload_sct0_addr register
 *  L1 instruction Cache 2 autoload section 0 address configure register
 */
typedef union {
    struct {
        /** l1_icache2_autoload_sct0_addr : HRO; bitpos: [31:0]; default: 0;
         *  Configures the start address of the first section for autoload operation on
         *  L1-ICache2. Note that it should be used together with L1_ICACHE2_AUTOLOAD_SCT0_SIZE
         *  and L1_ICACHE_AUTOLOAD_SCT0_ENA.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_autoload_sct0_addr:32;
    };
    uint32_t val;
} cache_l1_icache2_autoload_sct0_addr_reg_t;

/** Type of l1_icache2_autoload_sct0_size register
 *  L1 instruction Cache 2 autoload section 0 size configure register
 */
typedef union {
    struct {
        /** l1_icache2_autoload_sct0_size : HRO; bitpos: [27:0]; default: 0;
         *  Configures the size of the first section for autoload operation on L1-ICache2. Note
         *  that it should be used together with L1_ICACHE2_AUTOLOAD_SCT0_ADDR and
         *  L1_ICACHE_AUTOLOAD_SCT0_ENA.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_autoload_sct0_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l1_icache2_autoload_sct0_size_reg_t;

/** Type of l1_icache2_autoload_sct1_addr register
 *  L1 instruction Cache 2 autoload section 1 address configure register
 */
typedef union {
    struct {
        /** l1_icache2_autoload_sct1_addr : HRO; bitpos: [31:0]; default: 0;
         *  Configures the start address of the second section for autoload operation on
         *  L1-ICache2. Note that it should be used together with L1_ICACHE2_AUTOLOAD_SCT1_SIZE
         *  and L1_ICACHE_AUTOLOAD_SCT1_ENA.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_autoload_sct1_addr:32;
    };
    uint32_t val;
} cache_l1_icache2_autoload_sct1_addr_reg_t;

/** Type of l1_icache2_autoload_sct1_size register
 *  L1 instruction Cache 2 autoload section 1 size configure register
 */
typedef union {
    struct {
        /** l1_icache2_autoload_sct1_size : HRO; bitpos: [27:0]; default: 0;
         *  Configures the size of the second section for autoload operation on L1-ICache2.
         *  Note that it should be used together with L1_ICACHE2_AUTOLOAD_SCT1_ADDR and
         *  L1_ICACHE_AUTOLOAD_SCT1_ENA.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_autoload_sct1_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l1_icache2_autoload_sct1_size_reg_t;

/** Type of l1_icache3_autoload_ctrl register
 *  L1 instruction Cache 3 autoload-operation control register
 */
typedef union {
    struct {
        /** l1_icache3_autoload_ena : HRO; bitpos: [0]; default: 0;
         *  Configures and disable autoload operation on L1-ICache3.  1: enable, 0: disable.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_autoload_ena:1;
        /** l1_icache3_autoload_done : RO; bitpos: [1]; default: 1;
         *  The bit is used to indicate whether autoload operation on L1-ICache3 is finished or
         *  not. 0: not finished. 1: finished.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_autoload_done:1;
        /** l1_icache3_autoload_order : HRO; bitpos: [2]; default: 0;
         *  Configures the direction of autoload operation on L1-ICache3. 0: ascending. 1:
         *  descending.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_autoload_order:1;
        /** l1_icache3_autoload_trigger_mode : HRO; bitpos: [4:3]; default: 0;
         *  The field is used to configure trigger mode of autoload operation on L1-ICache3.
         *  0/3: miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_autoload_trigger_mode:2;
        uint32_t reserved_5:3;
        /** l1_icache3_autoload_sct0_ena : HRO; bitpos: [8]; default: 0;
         *  Configures the first section for autoload operation on L1-ICache3.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_autoload_sct0_ena:1;
        /** l1_icache3_autoload_sct1_ena : HRO; bitpos: [9]; default: 0;
         *  Configures the second section for autoload operation on L1-ICache3.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_autoload_sct1_ena:1;
        /** l1_icache3_autoload_rgid : HRO; bitpos: [13:10]; default: 0;
         *  Configures the gid of l1 icache3 autoload.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_autoload_rgid:4;
        uint32_t reserved_14:18;
    };
    uint32_t val;
} cache_l1_icache3_autoload_ctrl_reg_t;

/** Type of l1_icache3_autoload_sct0_addr register
 *  L1 instruction Cache 3 autoload section 0 address configure register
 */
typedef union {
    struct {
        /** l1_icache3_autoload_sct0_addr : HRO; bitpos: [31:0]; default: 0;
         *  Configures the start address of the first section for autoload operation on
         *  L1-ICache3. Note that it should be used together with L1_ICACHE3_AUTOLOAD_SCT0_SIZE
         *  and L1_ICACHE_AUTOLOAD_SCT0_ENA.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_autoload_sct0_addr:32;
    };
    uint32_t val;
} cache_l1_icache3_autoload_sct0_addr_reg_t;

/** Type of l1_icache3_autoload_sct0_size register
 *  L1 instruction Cache 3 autoload section 0 size configure register
 */
typedef union {
    struct {
        /** l1_icache3_autoload_sct0_size : HRO; bitpos: [27:0]; default: 0;
         *  Configures the size of the first section for autoload operation on L1-ICache3. Note
         *  that it should be used together with L1_ICACHE3_AUTOLOAD_SCT0_ADDR and
         *  L1_ICACHE_AUTOLOAD_SCT0_ENA.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_autoload_sct0_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l1_icache3_autoload_sct0_size_reg_t;

/** Type of l1_icache3_autoload_sct1_addr register
 *  L1 instruction Cache 3 autoload section 1 address configure register
 */
typedef union {
    struct {
        /** l1_icache3_autoload_sct1_addr : HRO; bitpos: [31:0]; default: 0;
         *  Configures the start address of the second section for autoload operation on
         *  L1-ICache3. Note that it should be used together with L1_ICACHE3_AUTOLOAD_SCT1_SIZE
         *  and L1_ICACHE_AUTOLOAD_SCT1_ENA.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_autoload_sct1_addr:32;
    };
    uint32_t val;
} cache_l1_icache3_autoload_sct1_addr_reg_t;

/** Type of l1_icache3_autoload_sct1_size register
 *  L1 instruction Cache 3 autoload section 1 size configure register
 */
typedef union {
    struct {
        /** l1_icache3_autoload_sct1_size : HRO; bitpos: [27:0]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_autoload_sct1_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l1_icache3_autoload_sct1_size_reg_t;

/** Type of l1_dcache_autoload_ctrl register
 *  L1 data Cache autoload-operation control register
 */
typedef union {
    struct {
        /** l1_dcache_autoload_ena : R/W; bitpos: [0]; default: 0;
         *  Configures whether to enable the autoloading operation in dcache.
         *  1: Enable
         */
        uint32_t l1_dcache_autoload_ena:1;
        /** l1_dcache_autoload_done : RO; bitpos: [1]; default: 1;
         *  Indicates whether the autoloading operation in dcache has finished.
         *  1: Finished
         */
        uint32_t l1_dcache_autoload_done:1;
        /** l1_dcache_autoload_order : R/W; bitpos: [2]; default: 0;
         *  Configures the direction of the autoloading operation in dcache.
         *  1: Descending
         */
        uint32_t l1_dcache_autoload_order:1;
        /** l1_dcache_autoload_trigger_mode : R/W; bitpos: [4:3]; default: 0;
         *  Configures the trigger mode of the autoloading operation in dcache.
         *  2: Triggered by cache miss or hit
         */
        uint32_t l1_dcache_autoload_trigger_mode:2;
        uint32_t reserved_5:3;
        /** l1_dcache_autoload_sct0_ena : R/W; bitpos: [8]; default: 0;
         *  Configures whether to enable Section 0 for the autoloading operation in dcache.
         *  1: Enable
         */
        uint32_t l1_dcache_autoload_sct0_ena:1;
        /** l1_dcache_autoload_sct1_ena : R/W; bitpos: [9]; default: 0;
         *  Configures whether to enable Section 1 for the autoloading operation in dcache.
         *  1: Enable
         */
        uint32_t l1_dcache_autoload_sct1_ena:1;
        /** l1_dcache_autoload_sct2_ena : R/W; bitpos: [10]; default: 0;
         *  Configures whether to enable Section 2 for the autoloading operation in dcache.
         *  1: Enable
         */
        uint32_t l1_dcache_autoload_sct2_ena:1;
        /** l1_dcache_autoload_sct3_ena : R/W; bitpos: [11]; default: 0;
         *  Configures whether to enable Section 3 for the autoloading operation in dcache.
         *  1: Enable
         */
        uint32_t l1_dcache_autoload_sct3_ena:1;
        /** l1_dcache_autoload_rgid : R/W; bitpos: [15:12]; default: 0;
         *  Configures the gid of l1 dcache autoload.
         */
        uint32_t l1_dcache_autoload_rgid:4;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} cache_l1_dcache_autoload_ctrl_reg_t;

/** Type of l1_dcache_autoload_sct0_addr register
 *  L1 data Cache autoload section 0 address configure register
 */
typedef union {
    struct {
        /** l1_dcache_autoload_sct0_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the start address of the first section for autoload operation on
         *  L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT0_SIZE
         *  and L1_DCACHE_AUTOLOAD_SCT0_ENA.
         */
        uint32_t l1_dcache_autoload_sct0_addr:32;
    };
    uint32_t val;
} cache_l1_dcache_autoload_sct0_addr_reg_t;

