espressif/esp-idf/components/soc/esp32s31/register/soc/cache_struct.h
/** Type of l1_dcache_autoload_sct0_size register
 *  L1 data Cache autoload section 0 size configure register
 */
typedef union {
    struct {
        /** l1_dcache_autoload_sct0_size : R/W; bitpos: [27:0]; default: 0;
         *  Configures the size of the first section for autoload operation on L1-DCache. Note
         *  that it should be used together with L1_DCACHE_AUTOLOAD_SCT0_ADDR and
         *  L1_DCACHE_AUTOLOAD_SCT0_ENA.
         */
        uint32_t l1_dcache_autoload_sct0_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l1_dcache_autoload_sct0_size_reg_t;

/** Type of l1_dcache_autoload_sct1_addr register
 *  L1 data Cache autoload section 1 address configure register
 */
typedef union {
    struct {
        /** l1_dcache_autoload_sct1_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the start address of the second section for autoload operation on
         *  L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT1_SIZE
         *  and L1_DCACHE_AUTOLOAD_SCT1_ENA.
         */
        uint32_t l1_dcache_autoload_sct1_addr:32;
    };
    uint32_t val;
} cache_l1_dcache_autoload_sct1_addr_reg_t;

/** Type of l1_dcache_autoload_sct1_size register
 *  L1 data Cache autoload section 1 size configure register
 */
typedef union {
    struct {
        /** l1_dcache_autoload_sct1_size : R/W; bitpos: [27:0]; default: 0;
         *  Configures the size of the second section for autoload operation on L1-DCache. Note
         *  that it should be used together with L1_DCACHE_AUTOLOAD_SCT1_ADDR and
         *  L1_DCACHE_AUTOLOAD_SCT1_ENA.
         */
        uint32_t l1_dcache_autoload_sct1_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l1_dcache_autoload_sct1_size_reg_t;

/** Type of l1_dcache_autoload_sct2_addr register
 *  L1 data Cache autoload section 2 address configure register
 */
typedef union {
    struct {
        /** l1_dcache_autoload_sct2_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the start address of the third section for autoload operation on
         *  L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT2_SIZE
         *  and L1_DCACHE_AUTOLOAD_SCT2_ENA.
         */
        uint32_t l1_dcache_autoload_sct2_addr:32;
    };
    uint32_t val;
} cache_l1_dcache_autoload_sct2_addr_reg_t;

/** Type of l1_dcache_autoload_sct2_size register
 *  L1 data Cache autoload section 2 size configure register
 */
typedef union {
    struct {
        /** l1_dcache_autoload_sct2_size : R/W; bitpos: [27:0]; default: 0;
         *  Configures the size of the third section for autoload operation on L1-DCache. Note
         *  that it should be used together with L1_DCACHE_AUTOLOAD_SCT2_ADDR and
         *  L1_DCACHE_AUTOLOAD_SCT2_ENA.
         */
        uint32_t l1_dcache_autoload_sct2_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l1_dcache_autoload_sct2_size_reg_t;

/** Type of l1_dcache_autoload_sct3_addr register
 *  L1 data Cache autoload section 1 address configure register
 */
typedef union {
    struct {
        /** l1_dcache_autoload_sct3_addr : R/W; bitpos: [31:0]; default: 0;
         *  Configures the start address of the fourth section for autoload operation on
         *  L1-DCache. Note that it should be used together with L1_DCACHE_AUTOLOAD_SCT3_SIZE
         *  and L1_DCACHE_AUTOLOAD_SCT3_ENA.
         */
        uint32_t l1_dcache_autoload_sct3_addr:32;
    };
    uint32_t val;
} cache_l1_dcache_autoload_sct3_addr_reg_t;

/** Type of l1_dcache_autoload_sct3_size register
 *  L1 data Cache autoload section 1 size configure register
 */
typedef union {
    struct {
        /** l1_dcache_autoload_sct3_size : R/W; bitpos: [27:0]; default: 0;
         *  Configures the size of the fourth section for autoload operation on L1-DCache. Note
         *  that it should be used together with L1_DCACHE_AUTOLOAD_SCT3_ADDR and
         *  L1_DCACHE_AUTOLOAD_SCT3_ENA.
         */
        uint32_t l1_dcache_autoload_sct3_size:28;
        uint32_t reserved_28:4;
    };
    uint32_t val;
} cache_l1_dcache_autoload_sct3_size_reg_t;

/** Type of l2_cache_autoload_ctrl register
 *  L2 Cache autoload-operation control register
 */
typedef union {
    struct {
        /** l2_cache_autoload_ena : HRO; bitpos: [0]; default: 0;
         *  Configures and disable autoload operation on L2-Cache.  1: enable, 0: disable.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_autoload_ena:1;
        /** l2_cache_autoload_done : RO; bitpos: [1]; default: 1;
         *  The bit is used to indicate whether autoload operation on L2-Cache is finished or
         *  not. 0: not finished. 1: finished.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_autoload_done:1;
        /** l2_cache_autoload_order : HRO; bitpos: [2]; default: 0;
         *  Configures the direction of autoload operation on L2-Cache. 0: ascending. 1:
         *  descending.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_autoload_order:1;
        /** l2_cache_autoload_trigger_mode : HRO; bitpos: [4:3]; default: 0;
         *  The field is used to configure trigger mode of autoload operation on L2-Cache. 0/3:
         *  miss-trigger, 1: hit-trigger, 2: miss-hit-trigger.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_autoload_trigger_mode:2;
        uint32_t reserved_5:3;
        /** l2_cache_autoload_sct0_ena : HRO; bitpos: [8]; default: 0;
         *  Configures the first section for autoload operation on L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_autoload_sct0_ena:1;
        /** l2_cache_autoload_sct1_ena : HRO; bitpos: [9]; default: 0;
         *  Configures the second section for autoload operation on L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_autoload_sct1_ena:1;
        /** l2_cache_autoload_sct2_ena : HRO; bitpos: [10]; default: 0;
         *  Configures the third section for autoload operation on L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_autoload_sct2_ena:1;
        /** l2_cache_autoload_sct3_ena : HRO; bitpos: [11]; default: 0;
         *  Configures the fourth section for autoload operation on L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_autoload_sct3_ena:1;
        /** l2_cache_autoload_rgid : HRO; bitpos: [15:12]; default: 0;
         *  Configures the gid of l2 cache autoload.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_autoload_rgid:4;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} cache_l2_cache_autoload_ctrl_reg_t;

