espressif/esp-idf/components/soc/esp32s31/register/soc/cache_struct.h
/** Type of l2_cache_acs_cnt_int_ena register
 *  Cache Access Counter Interrupt enable register
 */
typedef union {
    struct {
        uint32_t reserved_0:8;
        /** l2_ibus0_ovf_int_ena : HRO; bitpos: [8]; default: 0;
         *  Configures interrupt of one of counters overflow that occurs in L2-Cache due to
         *  bus0 accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus0_ovf_int_ena:1;
        /** l2_ibus1_ovf_int_ena : HRO; bitpos: [9]; default: 0;
         *  Configures interrupt of one of counters overflow that occurs in L2-Cache due to
         *  bus1 accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus1_ovf_int_ena:1;
        /** l2_ibus2_ovf_int_ena : HRO; bitpos: [10]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus2_ovf_int_ena:1;
        /** l2_ibus3_ovf_int_ena : HRO; bitpos: [11]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus3_ovf_int_ena:1;
        /** l2_dbus0_ovf_int_ena : HRO; bitpos: [12]; default: 0;
         *  Configures interrupt of one of counters overflow that occurs in L2-Cache due to
         *  bus0 accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus0_ovf_int_ena:1;
        /** l2_dbus1_ovf_int_ena : HRO; bitpos: [13]; default: 0;
         *  Configures interrupt of one of counters overflow that occurs in L2-Cache due to
         *  bus1 accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus1_ovf_int_ena:1;
        /** l2_dbus2_ovf_int_ena : HRO; bitpos: [14]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus2_ovf_int_ena:1;
        /** l2_dbus3_ovf_int_ena : HRO; bitpos: [15]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus3_ovf_int_ena:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} cache_l2_cache_acs_cnt_int_ena_reg_t;

/** Type of l2_cache_acs_cnt_int_clr register
 *  Cache Access Counter Interrupt clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:8;
        /** l2_ibus0_ovf_int_clr : WT; bitpos: [8]; default: 0;
         *  The bit is used to clear counters overflow interrupt and counters in L2-Cache due
         *  to bus0 accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus0_ovf_int_clr:1;
        /** l2_ibus1_ovf_int_clr : WT; bitpos: [9]; default: 0;
         *  The bit is used to clear counters overflow interrupt and counters in L2-Cache due
         *  to bus1 accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus1_ovf_int_clr:1;
        /** l2_ibus2_ovf_int_clr : HRO; bitpos: [10]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus2_ovf_int_clr:1;
        /** l2_ibus3_ovf_int_clr : HRO; bitpos: [11]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus3_ovf_int_clr:1;
        /** l2_dbus0_ovf_int_clr : WT; bitpos: [12]; default: 0;
         *  The bit is used to clear counters overflow interrupt and counters in L2-Cache due
         *  to bus0 accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus0_ovf_int_clr:1;
        /** l2_dbus1_ovf_int_clr : WT; bitpos: [13]; default: 0;
         *  The bit is used to clear counters overflow interrupt and counters in L2-Cache due
         *  to bus1 accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus1_ovf_int_clr:1;
        /** l2_dbus2_ovf_int_clr : HRO; bitpos: [14]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus2_ovf_int_clr:1;
        /** l2_dbus3_ovf_int_clr : HRO; bitpos: [15]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus3_ovf_int_clr:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} cache_l2_cache_acs_cnt_int_clr_reg_t;

/** Type of l2_cache_acs_cnt_int_raw register
 *  Cache Access Counter Interrupt raw register
 */
typedef union {
    struct {
        uint32_t reserved_0:8;
        /** l2_ibus0_ovf_int_raw : R/WTC/SS; bitpos: [8]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
         *  due to bus0 accesses L2-ICache0.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus0_ovf_int_raw:1;
        /** l2_ibus1_ovf_int_raw : R/WTC/SS; bitpos: [9]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
         *  due to bus1 accesses L2-ICache1.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus1_ovf_int_raw:1;
        /** l2_ibus2_ovf_int_raw : R/WTC/SS; bitpos: [10]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
         *  due to bus2 accesses L2-ICache2.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus2_ovf_int_raw:1;
        /** l2_ibus3_ovf_int_raw : R/WTC/SS; bitpos: [11]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
         *  due to bus3 accesses L2-ICache3.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus3_ovf_int_raw:1;
        /** l2_dbus0_ovf_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
         *  due to bus0 accesses L2-DCache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus0_ovf_int_raw:1;
        /** l2_dbus1_ovf_int_raw : R/WTC/SS; bitpos: [13]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
         *  due to bus1 accesses L2-DCache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus1_ovf_int_raw:1;
        /** l2_dbus2_ovf_int_raw : R/WTC/SS; bitpos: [14]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
         *  due to bus2 accesses L2-DCache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus2_ovf_int_raw:1;
        /** l2_dbus3_ovf_int_raw : R/WTC/SS; bitpos: [15]; default: 0;
         *  The raw bit of the interrupt of one of counters overflow that occurs in L2-Cache
         *  due to bus3 accesses L2-DCache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus3_ovf_int_raw:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} cache_l2_cache_acs_cnt_int_raw_reg_t;

/** Type of l2_cache_acs_cnt_int_st register
 *  Cache Access Counter Interrupt status register
 */
typedef union {
    struct {
        uint32_t reserved_0:8;
        /** l2_ibus0_ovf_int_st : RO; bitpos: [8]; default: 0;
         *  The bit indicates the interrupt status of one of counters overflow that occurs in
         *  L2-Cache due to bus0 accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus0_ovf_int_st:1;
        /** l2_ibus1_ovf_int_st : RO; bitpos: [9]; default: 0;
         *  The bit indicates the interrupt status of one of counters overflow that occurs in
         *  L2-Cache due to bus1 accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus1_ovf_int_st:1;
        /** l2_ibus2_ovf_int_st : HRO; bitpos: [10]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus2_ovf_int_st:1;
        /** l2_ibus3_ovf_int_st : HRO; bitpos: [11]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_ibus3_ovf_int_st:1;
        /** l2_dbus0_ovf_int_st : RO; bitpos: [12]; default: 0;
         *  The bit indicates the interrupt status of one of counters overflow that occurs in
         *  L2-Cache due to bus0 accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus0_ovf_int_st:1;
        /** l2_dbus1_ovf_int_st : RO; bitpos: [13]; default: 0;
         *  The bit indicates the interrupt status of one of counters overflow that occurs in
         *  L2-Cache due to bus1 accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus1_ovf_int_st:1;
        /** l2_dbus2_ovf_int_st : HRO; bitpos: [14]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus2_ovf_int_st:1;
        /** l2_dbus3_ovf_int_st : HRO; bitpos: [15]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_dbus3_ovf_int_st:1;
        uint32_t reserved_16:16;
    };
    uint32_t val;
} cache_l2_cache_acs_cnt_int_st_reg_t;

/** Type of l2_cache_acs_fail_int_ena register
 *  Cache Access Fail Interrupt enable register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_fail_int_ena : HRO; bitpos: [5]; default: 0;
         *  Configures interrupt of access fail that occurs in L2-Cache due to l1 cache
         *  accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_fail_int_ena:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l2_cache_acs_fail_int_ena_reg_t;

/** Type of l2_cache_acs_fail_int_clr register
 *  L1-Cache Access Fail Interrupt clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_fail_int_clr : WT; bitpos: [5]; default: 0;
         *  The bit is used to clear interrupt of access fail that occurs in L2-Cache due to l1
         *  cache accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_fail_int_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l2_cache_acs_fail_int_clr_reg_t;

/** Type of l2_cache_acs_fail_int_raw register
 *  Cache Access Fail Interrupt raw register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_fail_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw bit of the interrupt of access fail that occurs in L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_fail_int_raw:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l2_cache_acs_fail_int_raw_reg_t;

