espressif/esp-idf/components/soc/esp32s31/register/soc/cache_struct.h
/** Type of l2_cache_acs_fail_int_st register
 *  Cache Access Fail Interrupt status register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_fail_int_st : RO; bitpos: [5]; default: 0;
         *  The bit indicates the interrupt status of access fail that occurs in L2-Cache due
         *  to l1 cache accesses L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_fail_int_st:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l2_cache_acs_fail_int_st_reg_t;

/** Type of l2_cache_sync_preload_int_ena register
 *  L1-Cache Access Fail Interrupt enable register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_pld_done_int_ena : HRO; bitpos: [5]; default: 0;
         *  Configures interrupt of L2-Cache preload-operation done.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_pld_done_int_ena:1;
        uint32_t reserved_6:6;
        /** l2_cache_pld_err_int_ena : HRO; bitpos: [12]; default: 0;
         *  Configures interrupt of L2-Cache preload-operation error.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_pld_err_int_ena:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} cache_l2_cache_sync_preload_int_ena_reg_t;

/** Type of l2_cache_sync_preload_int_clr register
 *  Sync Preload operation Interrupt clear register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_pld_done_int_clr : WT; bitpos: [5]; default: 0;
         *  The bit is used to clear interrupt that occurs only when L2-Cache preload-operation
         *  is done.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_pld_done_int_clr:1;
        uint32_t reserved_6:6;
        /** l2_cache_pld_err_int_clr : WT; bitpos: [12]; default: 0;
         *  The bit is used to clear interrupt of L2-Cache preload-operation error.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_pld_err_int_clr:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} cache_l2_cache_sync_preload_int_clr_reg_t;

/** Type of l2_cache_sync_preload_int_raw register
 *  Sync Preload operation Interrupt raw register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_pld_done_int_raw : R/WTC/SS; bitpos: [5]; default: 0;
         *  The raw bit of the interrupt that occurs only when L2-Cache preload-operation is
         *  done.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_pld_done_int_raw:1;
        uint32_t reserved_6:6;
        /** l2_cache_pld_err_int_raw : R/WTC/SS; bitpos: [12]; default: 0;
         *  The raw bit of the interrupt that occurs only when L2-Cache preload-operation error
         *  occurs.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_pld_err_int_raw:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} cache_l2_cache_sync_preload_int_raw_reg_t;

/** Type of l2_cache_sync_preload_int_st register
 *  L1-Cache Access Fail Interrupt status register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_pld_done_int_st : RO; bitpos: [5]; default: 0;
         *  The bit indicates the status of the interrupt that occurs only when L2-Cache
         *  preload-operation is done.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_pld_done_int_st:1;
        uint32_t reserved_6:6;
        /** l2_cache_pld_err_int_st : RO; bitpos: [12]; default: 0;
         *  The bit indicates the status of the interrupt of L2-Cache preload-operation error.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_pld_err_int_st:1;
        uint32_t reserved_13:19;
    };
    uint32_t val;
} cache_l2_cache_sync_preload_int_st_reg_t;


/** Group: Cache Access Fail Configuration register */
/** Type of l1_cache_acs_fail_ctrl register
 *  Cache Access Fail Configuration register
 */
typedef union {
    struct {
        /** l1_icache0_acs_fail_check_mode : R/W; bitpos: [0]; default: 0;
         *  Configures l1 icache0 access fail check mode. 0: the access fail is not propagated
         *  to the request, 1: the access fail is propagated to the request
         */
        uint32_t l1_icache0_acs_fail_check_mode:1;
        /** l1_icache1_acs_fail_check_mode : R/W; bitpos: [1]; default: 0;
         *  Configures l1 icache1 access fail check mode. 0: the access fail is not propagated
         *  to the request, 1: the access fail is propagated to the request
         */
        uint32_t l1_icache1_acs_fail_check_mode:1;
        /** l1_icache2_acs_fail_check_mode : R/W; bitpos: [2]; default: 0;
         *  Configures l1 icache2 access fail check mode. 0: the access fail is not propagated
         *  to the request, 1: the access fail is propagated to the request
         */
        uint32_t l1_icache2_acs_fail_check_mode:1;
        /** l1_icache3_acs_fail_check_mode : R/W; bitpos: [3]; default: 0;
         *  Configures l1 icache3 access fail check mode. 0: the access fail is not propagated
         *  to the request, 1: the access fail is propagated to the request
         */
        uint32_t l1_icache3_acs_fail_check_mode:1;
        /** l1_dcache_acs_fail_check_mode : R/W; bitpos: [4]; default: 0;
         *  Configures l1 dcache access fail check mode. 0: the access fail is not propagated
         *  to the request, 1: the access fail is propagated to the request
         */
        uint32_t l1_dcache_acs_fail_check_mode:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_acs_fail_ctrl_reg_t;

