espressif/esp-idf/components/soc/esp32s31/register/soc/cache_struct.h
/** Type of l2_cache_acs_fail_ctrl register
 *  Cache Access Fail Configuration register
 */
typedef union {
    struct {
        /** l2_cache_acs_fail_check_mode : HRO; bitpos: [0]; default: 0;
         *  Configures l2 cache access fail check mode. 0: the access fail is not propagated to
         *  the request, 1: the access fail is propagated to the request
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_acs_fail_check_mode:1;
        uint32_t reserved_1:31;
    };
    uint32_t val;
} cache_l2_cache_acs_fail_ctrl_reg_t;


/** Group: Access Statistics registers */
/** Type of l1_cache_acs_cnt_ctrl register
 *  Cache Access Counter enable and clear register
 */
typedef union {
    struct {
        /** l1_ibus0_cnt_ena : R/W; bitpos: [0]; default: 0;
         *  Configures whether to enable IBUS0 counter.
         *  1: Enable
         */
        uint32_t l1_ibus0_cnt_ena:1;
        /** l1_ibus1_cnt_ena : R/W; bitpos: [1]; default: 0;
         *  Configures whether to enable IBUS1 counter.
         *  1: Enable
         */
        uint32_t l1_ibus1_cnt_ena:1;
        /** l1_ibus2_cnt_ena : R/W; bitpos: [2]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus2_cnt_ena:1;
        /** l1_ibus3_cnt_ena : R/W; bitpos: [3]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus3_cnt_ena:1;
        /** l1_dbus0_cnt_ena : R/W; bitpos: [4]; default: 0;
         *  Configures whether to enable DBUS0 counter.
         *  1: Enable
         */
        uint32_t l1_dbus0_cnt_ena:1;
        /** l1_dbus1_cnt_ena : R/W; bitpos: [5]; default: 0;
         *  Configures whether to enable DBUS1 counter.
         *  1: Enable
         */
        uint32_t l1_dbus1_cnt_ena:1;
        /** l1_dbus2_cnt_ena : R/W; bitpos: [6]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus2_cnt_ena:1;
        /** l1_dbus3_cnt_ena : R/W; bitpos: [7]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus3_cnt_ena:1;
        uint32_t reserved_8:8;
        /** l1_ibus0_cnt_clr : WT; bitpos: [16]; default: 0;
         *  Configures whether to clear IBUS0 counter.
         *  1: Clear
         */
        uint32_t l1_ibus0_cnt_clr:1;
        /** l1_ibus1_cnt_clr : WT; bitpos: [17]; default: 0;
         *  Configures whether to clear IBUS1 counter.
         *  1: Clear
         */
        uint32_t l1_ibus1_cnt_clr:1;
        /** l1_ibus2_cnt_clr : WT; bitpos: [18]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus2_cnt_clr:1;
        /** l1_ibus3_cnt_clr : WT; bitpos: [19]; default: 0;
         *  Reserved
         */
        uint32_t l1_ibus3_cnt_clr:1;
        /** l1_dbus0_cnt_clr : WT; bitpos: [20]; default: 0;
         *  Configures whether to clear DBUS0 counter.
         *  1: Clear
         */
        uint32_t l1_dbus0_cnt_clr:1;
        /** l1_dbus1_cnt_clr : WT; bitpos: [21]; default: 0;
         *  Configures whether to clear DBUS1 counter.
         *  1: Clear
         */
        uint32_t l1_dbus1_cnt_clr:1;
        /** l1_dbus2_cnt_clr : WT; bitpos: [22]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus2_cnt_clr:1;
        /** l1_dbus3_cnt_clr : WT; bitpos: [23]; default: 0;
         *  Reserved
         */
        uint32_t l1_dbus3_cnt_clr:1;
        uint32_t reserved_24:8;
    };
    uint32_t val;
} cache_l1_cache_acs_cnt_ctrl_reg_t;

/** Type of l1_ibus0_acs_hit_cnt register
 *  L1-ICache bus0 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus0_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when bus0 accesses L1-ICache0.
         */
        uint32_t l1_ibus0_hit_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus0_acs_hit_cnt_reg_t;

/** Type of l1_ibus0_acs_miss_cnt register
 *  L1-ICache bus0 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus0_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when bus0 accesses L1-ICache0.
         */
        uint32_t l1_ibus0_miss_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus0_acs_miss_cnt_reg_t;

/** Type of l1_ibus0_acs_conflict_cnt register
 *  L1-ICache bus0 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus0_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when bus0 accesses L1-ICache0.
         */
        uint32_t l1_ibus0_conflict_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus0_acs_conflict_cnt_reg_t;

/** Type of l1_ibus0_acs_nxtlvl_rd_cnt register
 *  L1-ICache bus0 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus0_nxtlvl_rd_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L1-ICache accesses L2-Cache due to
         *  bus0 accessing L1-ICache0.
         */
        uint32_t l1_ibus0_nxtlvl_rd_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus0_acs_nxtlvl_rd_cnt_reg_t;

/** Type of l1_ibus1_acs_hit_cnt register
 *  L1-ICache bus1 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus1_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when bus1 accesses L1-ICache1.
         */
        uint32_t l1_ibus1_hit_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus1_acs_hit_cnt_reg_t;

/** Type of l1_ibus1_acs_miss_cnt register
 *  L1-ICache bus1 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus1_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when bus1 accesses L1-ICache1.
         */
        uint32_t l1_ibus1_miss_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus1_acs_miss_cnt_reg_t;

/** Type of l1_ibus1_acs_conflict_cnt register
 *  L1-ICache bus1 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus1_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when bus1 accesses L1-ICache1.
         */
        uint32_t l1_ibus1_conflict_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus1_acs_conflict_cnt_reg_t;

/** Type of l1_ibus1_acs_nxtlvl_rd_cnt register
 *  L1-ICache bus1 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus1_nxtlvl_rd_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L1-ICache accesses L2-Cache due to
         *  bus1 accessing L1-ICache1.
         */
        uint32_t l1_ibus1_nxtlvl_rd_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus1_acs_nxtlvl_rd_cnt_reg_t;

