espressif/esp-idf/components/soc/esp32s31/register/soc/cache_struct.h
/** Type of l1_ibus2_acs_hit_cnt register
 *  L1-ICache bus2 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus2_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when bus2 accesses L1-ICache2.
         */
        uint32_t l1_ibus2_hit_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus2_acs_hit_cnt_reg_t;

/** Type of l1_ibus2_acs_miss_cnt register
 *  L1-ICache bus2 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus2_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when bus2 accesses L1-ICache2.
         */
        uint32_t l1_ibus2_miss_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus2_acs_miss_cnt_reg_t;

/** Type of l1_ibus2_acs_conflict_cnt register
 *  L1-ICache bus2 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus2_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when bus2 accesses L1-ICache2.
         */
        uint32_t l1_ibus2_conflict_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus2_acs_conflict_cnt_reg_t;

/** Type of l1_ibus2_acs_nxtlvl_rd_cnt register
 *  L1-ICache bus2 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus2_nxtlvl_rd_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L1-ICache accesses L2-Cache due to
         *  bus2 accessing L1-ICache2.
         */
        uint32_t l1_ibus2_nxtlvl_rd_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus2_acs_nxtlvl_rd_cnt_reg_t;

/** Type of l1_ibus3_acs_hit_cnt register
 *  L1-ICache bus3 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus3_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when bus3 accesses L1-ICache3.
         */
        uint32_t l1_ibus3_hit_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus3_acs_hit_cnt_reg_t;

/** Type of l1_ibus3_acs_miss_cnt register
 *  L1-ICache bus3 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus3_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when bus3 accesses L1-ICache3.
         */
        uint32_t l1_ibus3_miss_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus3_acs_miss_cnt_reg_t;

/** Type of l1_ibus3_acs_conflict_cnt register
 *  L1-ICache bus3 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus3_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when bus3 accesses L1-ICache3.
         */
        uint32_t l1_ibus3_conflict_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus3_acs_conflict_cnt_reg_t;

/** Type of l1_ibus3_acs_nxtlvl_rd_cnt register
 *  L1-ICache bus3 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l1_ibus3_nxtlvl_rd_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L1-ICache accesses L2-Cache due to
         *  bus3 accessing L1-ICache3.
         */
        uint32_t l1_ibus3_nxtlvl_rd_cnt:32;
    };
    uint32_t val;
} cache_l1_ibus3_acs_nxtlvl_rd_cnt_reg_t;

/** Type of l1_dbus0_acs_hit_cnt register
 *  L1-DCache bus0 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus0_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when bus0 accesses L1-DCache.
         */
        uint32_t l1_dbus0_hit_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus0_acs_hit_cnt_reg_t;

/** Type of l1_dbus0_acs_miss_cnt register
 *  L1-DCache bus0 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus0_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when bus0 accesses L1-DCache.
         */
        uint32_t l1_dbus0_miss_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus0_acs_miss_cnt_reg_t;

/** Type of l1_dbus0_acs_conflict_cnt register
 *  L1-DCache bus0 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus0_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when bus0 accesses L1-DCache.
         */
        uint32_t l1_dbus0_conflict_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus0_acs_conflict_cnt_reg_t;

/** Type of l1_dbus0_acs_nxtlvl_rd_cnt register
 *  L1-DCache bus0 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus0_nxtlvl_rd_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L1-DCache accesses L2-Cache due to
         *  bus0 accessing L1-DCache.
         */
        uint32_t l1_dbus0_nxtlvl_rd_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus0_acs_nxtlvl_rd_cnt_reg_t;

/** Type of l1_dbus0_acs_nxtlvl_wr_cnt register
 *  L1-DCache bus0 WB-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus0_nxtlvl_wr_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of write back when bus0 accesses L1-DCache.
         */
        uint32_t l1_dbus0_nxtlvl_wr_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus0_acs_nxtlvl_wr_cnt_reg_t;

/** Type of l1_dbus1_acs_hit_cnt register
 *  L1-DCache bus1 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus1_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when bus1 accesses L1-DCache.
         */
        uint32_t l1_dbus1_hit_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus1_acs_hit_cnt_reg_t;

/** Type of l1_dbus1_acs_miss_cnt register
 *  L1-DCache bus1 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus1_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when bus1 accesses L1-DCache.
         */
        uint32_t l1_dbus1_miss_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus1_acs_miss_cnt_reg_t;

/** Type of l1_dbus1_acs_conflict_cnt register
 *  L1-DCache bus1 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus1_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when bus1 accesses L1-DCache.
         */
        uint32_t l1_dbus1_conflict_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus1_acs_conflict_cnt_reg_t;

/** Type of l1_dbus1_acs_nxtlvl_rd_cnt register
 *  L1-DCache bus1 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus1_nxtlvl_rd_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L1-DCache accesses L2-Cache due to
         *  bus1 accessing L1-DCache.
         */
        uint32_t l1_dbus1_nxtlvl_rd_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus1_acs_nxtlvl_rd_cnt_reg_t;

/** Type of l1_dbus1_acs_nxtlvl_wr_cnt register
 *  L1-DCache bus1 WB-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus1_nxtlvl_wr_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of write back when bus1 accesses L1-DCache.
         */
        uint32_t l1_dbus1_nxtlvl_wr_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus1_acs_nxtlvl_wr_cnt_reg_t;

/** Type of l1_dbus2_acs_hit_cnt register
 *  L1-DCache bus2 Hit-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus2_hit_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of hits when bus2 accesses L1-DCache.
         */
        uint32_t l1_dbus2_hit_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus2_acs_hit_cnt_reg_t;

/** Type of l1_dbus2_acs_miss_cnt register
 *  L1-DCache bus2 Miss-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus2_miss_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of missing when bus2 accesses L1-DCache.
         */
        uint32_t l1_dbus2_miss_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus2_acs_miss_cnt_reg_t;

/** Type of l1_dbus2_acs_conflict_cnt register
 *  L1-DCache bus2 Conflict-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus2_conflict_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of access-conflicts when bus2 accesses L1-DCache.
         */
        uint32_t l1_dbus2_conflict_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus2_acs_conflict_cnt_reg_t;

/** Type of l1_dbus2_acs_nxtlvl_rd_cnt register
 *  L1-DCache bus2 Next-Level-Access Counter register
 */
typedef union {
    struct {
        /** l1_dbus2_nxtlvl_rd_cnt : RO; bitpos: [31:0]; default: 0;
         *  The register records the number of times that L1-DCache accesses L2-Cache due to
         *  bus2 accessing L1-DCache.
         */
        uint32_t l1_dbus2_nxtlvl_rd_cnt:32;
    };
    uint32_t val;
} cache_l1_dbus2_acs_nxtlvl_rd_cnt_reg_t;

