espressif/esp-idf/components/soc/esp32s31/register/soc/cache_struct.h
/** Group: Autoload buffer clear control and configuration registers */
/** Type of l1_cache_autoload_buf_clr_ctrl register
 *  Cache Autoload buffer clear control register
 */
typedef union {
    struct {
        /** l1_icache0_ald_buf_clr : R/W; bitpos: [0]; default: 0;
         *  Configures clear autoload-buffer inside L1-ICache0. If this bit is active, autoload
         *  will not work in L1-ICache0. This bit should not be active when autoload works in
         *  L1-ICache0.
         */
        uint32_t l1_icache0_ald_buf_clr:1;
        /** l1_icache1_ald_buf_clr : R/W; bitpos: [1]; default: 0;
         *  Configures clear autoload-buffer inside L1-ICache1. If this bit is active, autoload
         *  will not work in L1-ICache1. This bit should not be active when autoload works in
         *  L1-ICache1.
         */
        uint32_t l1_icache1_ald_buf_clr:1;
        /** l1_icache2_ald_buf_clr : R/W; bitpos: [2]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_ald_buf_clr:1;
        /** l1_icache3_ald_buf_clr : R/W; bitpos: [3]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_ald_buf_clr:1;
        /** l1_dcache_ald_buf_clr : R/W; bitpos: [4]; default: 0;
         *  Configures clear autoload-buffer inside L1-DCache. If this bit is active, autoload
         *  will not work in L1-DCache. This bit should not be active when autoload works in
         *  L1-DCache.
         */
        uint32_t l1_dcache_ald_buf_clr:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_cache_autoload_buf_clr_ctrl_reg_t;

/** Type of l2_cache_autoload_buf_clr_ctrl register
 *  Cache Autoload buffer clear control register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_ald_buf_clr : HRO; bitpos: [5]; default: 0;
         *  Configures clear autoload-buffer inside L2-Cache. If this bit is active, autoload
         *  will not work in L2-Cache. This bit should not be active when autoload works in
         *  L2-Cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_ald_buf_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l2_cache_autoload_buf_clr_ctrl_reg_t;


/** Group: Unallocate request buffer clear registers */
/** Type of l1_unallocate_buffer_clear register
 *  Unallocate request buffer clear registers
 */
typedef union {
    struct {
        /** l1_icache0_unalloc_clr : R/W; bitpos: [0]; default: 0;
         *  The bit is used to clear the unallocate request buffer of l1 icache0 where the
         *  unallocate request is responded but not completed.
         */
        uint32_t l1_icache0_unalloc_clr:1;
        /** l1_icache1_unalloc_clr : R/W; bitpos: [1]; default: 0;
         *  The bit is used to clear the unallocate request buffer of l1 icache1 where the
         *  unallocate request is responded but not completed.
         */
        uint32_t l1_icache1_unalloc_clr:1;
        /** l1_icache2_unalloc_clr : R/W; bitpos: [2]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_unalloc_clr:1;
        /** l1_icache3_unalloc_clr : R/W; bitpos: [3]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_unalloc_clr:1;
        /** l1_dcache_unalloc_clr : R/W; bitpos: [4]; default: 0;
         *  The bit is used to clear the unallocate request buffer of l1 dcache where the
         *  unallocate request is responded but not completed.
         */
        uint32_t l1_dcache_unalloc_clr:1;
        uint32_t reserved_5:27;
    };
    uint32_t val;
} cache_l1_unallocate_buffer_clear_reg_t;

/** Type of l2_unallocate_buffer_clear register
 *  Unallocate request buffer clear registers
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_unalloc_clr : HRO; bitpos: [5]; default: 0;
         *  The bit is used to clear the unallocate request buffer of l2 icache where the
         *  unallocate request is responded but not completed.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_unalloc_clr:1;
        uint32_t reserved_6:26;
    };
    uint32_t val;
} cache_l2_unallocate_buffer_clear_reg_t;


/** Group: Tag and Data Memory Access Control and configuration register */
/** Type of l1_cache_object_ctrl register
 *  Cache Tag and Data memory Object control register
 */
typedef union {
    struct {
        /** l1_icache0_tag_object : R/W; bitpos: [0]; default: 0;
         *  Configures set L1-ICache0 tag memory as object. This bit should be onehot with the
         *  others fields inside this register.
         */
        uint32_t l1_icache0_tag_object:1;
        /** l1_icache1_tag_object : R/W; bitpos: [1]; default: 0;
         *  Configures set L1-ICache1 tag memory as object. This bit should be onehot with the
         *  others fields inside this register.
         */
        uint32_t l1_icache1_tag_object:1;
        /** l1_icache2_tag_object : R/W; bitpos: [2]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_tag_object:1;
        /** l1_icache3_tag_object : R/W; bitpos: [3]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_tag_object:1;
        /** l1_dcache_tag_object : R/W; bitpos: [4]; default: 0;
         *  Configures set L1-DCache tag memory as object. This bit should be onehot with the
         *  others fields inside this register.
         */
        uint32_t l1_dcache_tag_object:1;
        uint32_t reserved_5:1;
        /** l1_icache0_mem_object : R/W; bitpos: [6]; default: 0;
         *  Configures set L1-ICache0 data memory as object. This bit should be onehot with the
         *  others fields inside this register.
         */
        uint32_t l1_icache0_mem_object:1;
        /** l1_icache1_mem_object : R/W; bitpos: [7]; default: 0;
         *  Configures set L1-ICache1 data memory as object. This bit should be onehot with the
         *  others fields inside this register.
         */
        uint32_t l1_icache1_mem_object:1;
        /** l1_icache2_mem_object : R/W; bitpos: [8]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache2_mem_object:1;
        /** l1_icache3_mem_object : R/W; bitpos: [9]; default: 0;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l1_icache3_mem_object:1;
        /** l1_dcache_mem_object : R/W; bitpos: [10]; default: 0;
         *  Configures set L1-DCache data memory as object. This bit should be onehot with the
         *  others fields inside this register.
         */
        uint32_t l1_dcache_mem_object:1;
        uint32_t reserved_11:21;
    };
    uint32_t val;
} cache_l1_cache_object_ctrl_reg_t;

/** Type of l1_cache_way_object register
 *  Cache Tag and Data memory way register
 */
typedef union {
    struct {
        /** l1_cache_way_object : R/W; bitpos: [2:0]; default: 0;
         *  Configures way of the tag-object will be accessed.
         *  1: way1
         */
        uint32_t l1_cache_way_object:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} cache_l1_cache_way_object_reg_t;

