espressif/esp-idf/components/soc/esp32s31/register/soc/cache_struct.h
/** Type of l1_cache_addr register
 *  Cache address register
 */
typedef union {
    struct {
        /** l1_cache_addr : R/W; bitpos: [31:0]; default: 1073741824;
         *  Those bits stores the address which will decide where inside the specified tag
         *  memory object will be accessed.
         */
        uint32_t l1_cache_addr:32;
    };
    uint32_t val;
} cache_l1_cache_addr_reg_t;

/** Type of l1_cache_debug_bus register
 *  Cache Tag/data memory content register
 */
typedef union {
    struct {
        /** l1_cache_debug_bus : R/W; bitpos: [31:0]; default: 620;
         *  This is a constant place where we can write data to or read data from the tag/data
         *  memory on the specified cache.
         */
        uint32_t l1_cache_debug_bus:32;
    };
    uint32_t val;
} cache_l1_cache_debug_bus_reg_t;

/** Type of l2_cache_object_ctrl register
 *  Cache Tag and Data memory Object control register
 */
typedef union {
    struct {
        uint32_t reserved_0:5;
        /** l2_cache_tag_object : HRO; bitpos: [5]; default: 0;
         *  Configures set L2-Cache tag memory as object. This bit should be onehot with the
         *  others fields inside this register.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_tag_object:1;
        uint32_t reserved_6:5;
        /** l2_cache_mem_object : HRO; bitpos: [11]; default: 0;
         *  Configures set L2-Cache data memory as object. This bit should be onehot with the
         *  others fields inside this register.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_mem_object:1;
        uint32_t reserved_12:20;
    };
    uint32_t val;
} cache_l2_cache_object_ctrl_reg_t;

/** Type of l2_cache_way_object register
 *  Cache Tag and Data memory way register
 */
typedef union {
    struct {
        /** l2_cache_way_object : HRO; bitpos: [2:0]; default: 0;
         *  Configures way of the tag-object will be accessed.
         *  7: way7
         *
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_way_object:3;
        uint32_t reserved_3:29;
    };
    uint32_t val;
} cache_l2_cache_way_object_reg_t;

/** Type of l2_cache_addr register
 *  Cache address register
 */
typedef union {
    struct {
        /** l2_cache_addr : HRO; bitpos: [31:0]; default: 1073741824;
         *  Those bits stores the address which will decide where inside the specified tag
         *  memory object will be accessed.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_addr:32;
    };
    uint32_t val;
} cache_l2_cache_addr_reg_t;

/** Type of l2_cache_debug_bus register
 *  Cache Tag/data memory content register
 */
typedef union {
    struct {
        /** l2_cache_debug_bus : R/W; bitpos: [31:0]; default: 972;
         *  This is a constant place where we can write data to or read data from the tag/data
         *  memory on the specified cache.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_debug_bus:32;
    };
    uint32_t val;
} cache_l2_cache_debug_bus_reg_t;


/** Group: Split L1 and L2 registers */
/** Type of level_split0 register
 *  USED TO SPLIT L1 CACHE AND L2 CACHE
 */
typedef union {
    struct {
        /** level_split0 : HRO; bitpos: [31:0]; default: 624;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t level_split0:32;
    };
    uint32_t val;
} cache_level_split0_reg_t;

/** Type of level_split1 register
 *  USED TO SPLIT L1 CACHE AND L2 CACHE
 */
typedef union {
    struct {
        /** level_split1 : HRO; bitpos: [31:0]; default: 976;
         *  Reserved
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t level_split1:32;
    };
    uint32_t val;
} cache_level_split1_reg_t;


/** Group: L2 cache access attribute control register */
/** Type of l2_cache_access_attr_ctrl register
 *  L2 cache access attribute control register
 */
typedef union {
    struct {
        /** l2_cache_access_force_cc : HRO; bitpos: [0]; default: 1;
         *  Configures force the request to l2 cache with cacheable attribute, otherwise, the
         *  attribute is propagated from L1 cache or CPU, it could be one of cacheable and
         *  non-cacheable.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_access_force_cc:1;
        /** l2_cache_access_force_wb : HRO; bitpos: [1]; default: 1;
         *  Configures force the request to l2 cache with write-back attribute, otherwise, the
         *  attribute is propagated from L1 cache or CPU, it could be one of write-back and
         *  write-through.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_access_force_wb:1;
        /** l2_cache_access_force_wma : HRO; bitpos: [2]; default: 1;
         *  Configures force the request to l2 cache with write-miss-allocate attribute,
         *  otherwise, the attribute is propagated from L1 cache or CPU, it could be one of
         *  write-miss-allocate and write-miss-no-allocate.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_access_force_wma:1;
        /** l2_cache_access_force_rma : HRO; bitpos: [3]; default: 1;
         *  Configures force the request to l2 cache with read-miss-allocate attribute,
         *  otherwise, the attribute is propagated from L1 cache or CPU, it could be one of
         *  read-miss-allocate and read-miss-no-allocate.
         *  This field is only for internal debugging purposes. Do not use it in applications.
         */
        uint32_t l2_cache_access_force_rma:1;
        uint32_t reserved_4:28;
    };
    uint32_t val;
} cache_l2_cache_access_attr_ctrl_reg_t;


